## Pandas

### Dataframe format, Index position

### 1D is Series

In [97]:
import numpy as np
import pandas as pd

### Create a series

In [98]:
lables = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d  ={'a':10,'b':20,'c':30}

In [99]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [100]:
pd.Series(data=my_list,index=lables)

a    10
b    20
c    30
dtype: int64

In [101]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [102]:
pd.Series(arr,lables)

a    10
b    20
c    30
dtype: int64

In [103]:
# Dicrtionary

pd.Series(d)

a    10
b    20
c    30
dtype: int64

## Data in a Series

In [104]:
# We can use lables as data

pd.Series(data=lables)

0    a
1    b
2    c
dtype: object

In [105]:
# Even Functions

n = pd.Series(['sum','print','len'])
print(n)

0      sum
1    print
2      len
dtype: object

### Using an Index

In [106]:
ser1 = pd.Series([1,2,3,4],index = ['USA','GERMN','UK','UAE'])

In [107]:
ser1

USA      1
GERMN    2
UK       3
UAE      4
dtype: int64

In [108]:
ser2 = pd.Series(['USA','GERMN','UK','UAE'],index = [1,2,3,4])

In [ ]:
list(range(9))

In [109]:
ser2

1      USA
2    GERMN
3       UK
4      UAE
dtype: object

In [110]:
ser1['USA']

1

In [111]:
ser2[1:3]

2    GERMN
3       UK
dtype: object

In [112]:
ser2[3]

'UK'

In [113]:
ser3 = pd.Series([1,2,3,4],index = ['GERMN','UK','USA','UAE'])

In [114]:
ser1 + ser3

GERMN    3
UAE      8
UK       5
USA      4
dtype: int64

In [115]:
ser3 = pd.Series(['a','b','c','d'],index = ['GERMN','UK','USA','UAE'])
ser3

GERMN    a
UK       b
USA      c
UAE      d
dtype: object

In [116]:
ser3[2]

'c'

In [117]:
ser3[:2]

GERMN    a
UK       b
dtype: object

In [118]:
ser4 = pd.Series([1,2,3,4],index = ['USA','GERMN','USSR','UAE'])

In [119]:
ser1 + ser4

GERMN    4.0
UAE      8.0
UK       NaN
USA      2.0
USSR     NaN
dtype: float64

## Data Frames

In [120]:
from numpy.random import randn
np.random.seed(101)

In [121]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [122]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [123]:
print('A B C D'.split())

['A', 'B', 'C', 'D']

In [124]:
df1 = pd.DataFrame(randn(5,4))
df1

          0         1         2         3
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [125]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [126]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [127]:
df['W Z'.split()]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [128]:
df1[0]

0    0.302665
1   -0.134841
2    0.807706
3   -0.497104
4   -0.116773
Name: 0, dtype: float64

In [129]:
df1.iloc[3:4,2:3]

          2
3 -0.943406

In [130]:
# ":" repreents all
 
df1.iloc[:,:-1]

          0         1         2
0  0.302665  1.693723 -1.706086
1 -0.134841  0.390528  0.166905
2  0.807706  0.072960  0.638787
3 -0.497104 -0.754070 -0.943406
4 -0.116773  1.901755  0.238127

In [131]:
df.W # SQL syntax Not preferable

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [132]:
type(df['Y'])

pandas.core.series.Series

In [133]:
type(df)

pandas.core.frame.DataFrame

In [134]:
# Create a newColumn 

df['NEW'] = df['W'] + df['Y']

In [135]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

# Removing Column
-> axis - 1 is column wise

-> axis - 0 is row wise

In [136]:
df.drop('NEW',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [137]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [138]:
df.drop('NEW',axis=1,inplace=True)

In [139]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [140]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [141]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [142]:
# Selecting Row

df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [143]:
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [144]:
df.iloc[2:3]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [145]:
df.iloc[2:3]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

#  Selecting subset of rows and coulmns

In [146]:
# example

df.loc['B','Y']

-0.8480769834036315

In [147]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Conditional selection

In [149]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [150]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [151]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [153]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [154]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [156]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [157]:
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [158]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## More Index

In [159]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [161]:
# Reset to default 0,1,2..... index

df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [162]:
newind = 'CA NY WY IR CO'.split()

In [163]:
df['States'] = newind

In [164]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     IR
E  0.190794  1.978757  2.605967  0.683509     CO

In [165]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
IR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [166]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     IR
E  0.190794  1.978757  2.605967  0.683509     CO

In [167]:
df.set_index('States',inplace=True)

In [168]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
IR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-index and Index Hierarchy

In [169]:
# Index

outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [170]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [171]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [231]:
# Index

outside = ['G1','G1','G1','G2','G2','G2','G3','G3','G3']
inside = [1,2,3,1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [232]:
hier_index

MultiIndex(levels=[['G1', 'G2', 'G3'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]])

In [233]:
df = pd.DataFrame(np.random.randn(9,3),index=hier_index,columns=['A','B','C'])
df

             A         B         C
G1 1  0.544159  0.698296  1.252944
   2 -1.048347 -1.281320  1.276731
   3  0.645132 -0.297637  0.755742
G2 1  1.758122  0.307046  0.529927
   2  0.940120  0.746221 -0.141266
   3  0.085529 -1.883809 -1.314142
G3 1  2.601240 -0.612552 -1.714963
   2  1.350046  1.798990 -1.312854
   3  0.033590 -0.220208 -0.308472

In [234]:
df.loc['G1']

          A         B         C
1  0.544159  0.698296  1.252944
2 -1.048347 -1.281320  1.276731
3  0.645132 -0.297637  0.755742

In [236]:
df.loc['G1']

          A         B         C
1  0.544159  0.698296  1.252944
2 -1.048347 -1.281320  1.276731
3  0.645132 -0.297637  0.755742

In [238]:
df.loc['G1'].loc[1]

A    0.544159
B    0.698296
C    1.252944
Name: 1, dtype: float64

In [239]:
df.index.names

FrozenList([None, None])

In [241]:
df.index.names = ['Group','Num']

In [242]:
df

                  A         B         C
Group Num
G1    1    0.544159  0.698296  1.252944
      2   -1.048347 -1.281320  1.276731
      3    0.645132 -0.297637  0.755742
G2    1    1.758122  0.307046  0.529927
      2    0.940120  0.746221 -0.141266
      3    0.085529 -1.883809 -1.314142
G3    1    2.601240 -0.612552 -1.714963
      2    1.350046  1.798990 -1.312854
      3    0.033590 -0.220208 -0.308472

In [243]:
df.xs('G1')

            A         B         C
Num
1    0.544159  0.698296  1.252944
2   -1.048347 -1.281320  1.276731
3    0.645132 -0.297637  0.755742

In [245]:
df.xs(['G1',1]) # By using tuple notation it calling groups

A    0.544159
B    0.698296
C    1.252944
Name: (G1, 1), dtype: float64

In [246]:
df.xs(1,level='Num') # Need First row of all the groups which are existed in 'df'

              A         B         C
Group
G1     0.544159  0.698296  1.252944
G2     1.758122  0.307046  0.529927
G3     2.601240 -0.612552 -1.714963

## Missing Value

In [193]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [194]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [195]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [196]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [199]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [200]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

** Replace  or Imputation**

In [201]:
df.fillna(value='MY VAL')

        A       B  C
0       1       5  1
1       2  MY VAL  2
2  MY VAL  MY VAL  3

In [203]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [204]:
df['A'].fillna(value=df['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [206]:
df['B'].fillna(value=df['B'].median())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

## Groupby

In [215]:
# Gives single aggrigate functions by taking group values

import pandas as pd
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [216]:
df = pd.DataFrame(data)

In [217]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [218]:
df.groupby('Company') # It doesn't applicable on the string values appropriately as numarics

In [219]:
by_comp = df.groupby("Company")
by_comp

In [220]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [221]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [223]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [224]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [225]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [227]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [228]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [229]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64